# Microsoft AI School - Pandas Library
* Date: 12/27/2024
* Python Version: 3.13.1
* Notes: Pandas Version: 2.2.3

# 1. Pandas
* Python Data Analysis Library
* A library for data manipulation and analysis.
* Provides a wide range of data analysis functions.
* Allows creation and manipulation of data objects structured in rows and columns.

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.5 MB 11.8 MB/s eta 0:00:01
   ----------- ---------------------------- 3.4/11.5 MB 8.1 MB/s eta 0:00:01
   ------------------ --------------------- 5.2/11.5 MB 8.4 MB/s eta 0:00:01
   -------------------------- ------------- 7.6/11.5 MB 9.2 MB/s eta 0:00:01
   ----------------------------- ---------- 8.4/11.5 MB 9.4 MB/s eta 0:00:01
   ------------------------------- -------- 9.2/11.5 MB 7.2 MB/s eta 0:00:01
   ------------------------------------ --- 10.5/11.5 MB 7.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 7.0 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.

In [4]:
pd.__version__

'2.2.3'

# 2. Data Structures
* There are two main structures:
    * Series
    * DataFrame

## A. Series
* A one-dimensional array
* Contains data of a single type
* The index can be specified as strings; if not specified, it starts with numeric indices from 0.

In [2]:
import pandas as pd

In [6]:
s = pd.Series([3, -5, 7, 4])
print(s)
print(type(s))

0    3
1   -5
2    7
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
s = pd.Series([3, -5, 7, 4], index = ["a", "b", "c", "d"])
print(s)
print(s.index)
print(s.values)

a    3
b   -5
c    7
d    4
dtype: int64
Index(['a', 'b', 'c', 'd'], dtype='object')
[ 3 -5  7  4]

In [11]:
# Similar element-wise artihmetic operations like NumPy
print(s * 3)

a     9
b   -15
c    21
d    12
dtype: int64

## B. DataFrame
* A two-dimensional array (similar to a spreadsheet).
* Data is stored in a table-like format, with two main axes: index and columns.
* A DataFrame is essentially a collection of series combined together.

### I. Creating a DaataFrame
* In Pandas, DataFrame an be generated from a list of lists(2D list) or a dictionary.

In [13]:
df = pd.DataFrame({"State": ["Pennsylvania", "New York", "California"], 
                   "Area Code": [267, 212, 323], 
                   "Population (in millions)": [12.96, 8.26, 38.97]})
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

          State  Area Code  Population (in millions)
0  Pennsylvania        267                     12.96
1      New York        212                      8.26
2    California        323                     38.97

In [14]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
df.columns

Index(['State', 'Area Code', 'Population (in millions)'], dtype='object')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   State                     3 non-null      object
 1   Area Code                 3 non-null      int64
 2   Population (in millions)  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes

In [17]:
df.set_index("State")

              Area Code  Population (in millions)
State
Pennsylvania        267                     12.96
New York            212                      8.26
California          323                     38.97

# 3. Read CSV File

In [19]:
df = pd.read_csv("assets/heroes.csv")
df

      이름  나이     직업     국적    키            재산
0   아이언맨  58    CEO     미국  174  1.150000e+10
1     토르  45      신  아스가르드  190           NaN
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09
5   캡틴마블  25    파일럿     미국  170  3.400000e+08
6  블랙위도우  32    스파이    러시아  170  5.000000e+07

In [20]:
pd.options.display.float_format = '{:.0f}'.format

In [21]:
df

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes

In [23]:
df.head(3)

      이름  나이    직업     국적    키          재산
0   아이언맨  58   CEO     미국  174 11500000000
1     토르  45     신  아스가르드  190         NaN
2  스파이더맨  18  고등학생     미국  177         600

In [24]:
df.tail(3)

      이름  나이     직업   국적    키         재산
4     헐크  33  핵물리학자   미국  270 1000000000
5   캡틴마블  25    파일럿   미국  170  340000000
6  블랙위도우  32    스파이  러시아  170   50000000

In [25]:
df.describe()

       나이   키          재산
count   7   7           5
mean   34 190  2578000120
std    13  36  5003440739
min    18 170         600
25%    26 172    50000000
50%    32 177   340000000
75%    39 184  1000000000
max    58 270 11500000000

In [26]:
df["국적"]

0       미국
1    아스가르드
2       미국
3    데미스키라
4       미국
5       미국
6      러시아
Name: 국적, dtype: object

In [27]:
df["국적"].unique()

array(['미국', '아스가르드', '데미스키라', '러시아'], dtype=object)

In [28]:
df["국적"].value_counts()

국적
미국       4
아스가르드    1
데미스키라    1
러시아      1
Name: count, dtype: int64

In [30]:
df["나이"].nlargest(7)

0    58
1    45
4    33
6    32
3    27
5    25
2    18
Name: 나이, dtype: int64

In [31]:
df.nlargest(n=3, columns="키")

     이름  나이     직업     국적    키         재산
4    헐크  33  핵물리학자     미국  270 1000000000
1    토르  45      신  아스가르드  190        NaN
3  원더우먼  27     공주  데미스키라  178        NaN

In [33]:
df[["이름", "직업", "나이"]].nlargest(7, "나이")

      이름     직업  나이
0   아이언맨    CEO  58
1     토르      신  45
4     헐크  핵물리학자  33
6  블랙위도우    스파이  32
3   원더우먼     공주  27
5   캡틴마블    파일럿  25
2  스파이더맨   고등학생  18

In [34]:
df["이름"][1:6]

1       토르
2    스파이더맨
3     원더우먼
4       헐크
5     캡틴마블
Name: 이름, dtype: object

# 4. Indexing

## A. iloc
* Positional Indexing
* Syntax: df.iloc[row, column]

In [35]:
df.iloc[0]

이름          아이언맨
나이            58
직업           CEO
국적            미국
키            174
재산   11500000000
Name: 0, dtype: object

In [36]:
df.iloc[[1, 3, 4]]

     이름  나이     직업     국적    키         재산
1    토르  45      신  아스가르드  190        NaN
3  원더우먼  27     공주  데미스키라  178        NaN
4    헐크  33  핵물리학자     미국  270 1000000000

In [38]:
df.iloc[0:5, 0:3]

      이름  나이     직업
0   아이언맨  58    CEO
1     토르  45      신
2  스파이더맨  18   고등학생
3   원더우먼  27     공주
4     헐크  33  핵물리학자

## B. loc
* Label Indexing
* Syntax: df.loc[index_name, column name]

In [39]:
df2 = df.copy()
df2.index = ["a", "b", "c", "d", "e", "f", "g"]
df2

      이름  나이     직업     국적    키          재산
a   아이언맨  58    CEO     미국  174 11500000000
b     토르  45      신  아스가르드  190         NaN
c  스파이더맨  18   고등학생     미국  177         600
d   원더우먼  27     공주  데미스키라  178         NaN
e     헐크  33  핵물리학자     미국  270  1000000000
f   캡틴마블  25    파일럿     미국  170   340000000
g  블랙위도우  32    스파이    러시아  170    50000000

In [40]:
df2.loc["a"]

이름          아이언맨
나이            58
직업           CEO
국적            미국
키            174
재산   11500000000
Name: a, dtype: object

In [41]:
df2.loc["a":"b"]

     이름  나이   직업     국적    키          재산
a  아이언맨  58  CEO     미국  174 11500000000
b    토르  45    신  아스가르드  190         NaN

In [42]:
df2.loc["a":"b", "이름":"직업"]

     이름  나이   직업
a  아이언맨  58  CEO
b    토르  45    신

In [43]:
df

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes

In [45]:
df["재산"]

0   11500000000
1           NaN
2           600
3           NaN
4    1000000000
5     340000000
6      50000000
Name: 재산, dtype: float64

In [46]:
df['재산'].isnull()

0    False
1     True
2    False
3     True
4    False
5    False
6    False
Name: 재산, dtype: bool

can be used for fancy indexing

In [47]:
df[df['재산'].isnull()]

     이름  나이  직업     국적    키  재산
1    토르  45   신  아스가르드  190 NaN
3  원더우먼  27  공주  데미스키라  178 NaN

In [48]:
df["나이"] > 30

0     True
1     True
2    False
3    False
4     True
5    False
6     True
Name: 나이, dtype: bool

In [49]:
df[df["나이"] > 30]

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [54]:
# Using loc
df.loc[df["나이"] > 30]

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [51]:
df[(df["나이"] > 30) & (df["나이"] < 50)]

      이름  나이     직업     국적    키         재산
1     토르  45      신  아스가르드  190        NaN
4     헐크  33  핵물리학자     미국  270 1000000000
6  블랙위도우  32    스파이    러시아  170   50000000

In [55]:
df.sort_values("키")    # in ascending order

      이름  나이     직업     국적    키          재산
6  블랙위도우  32    스파이    러시아  170    50000000
5   캡틴마블  25    파일럿     미국  170   340000000
0   아이언맨  58    CEO     미국  174 11500000000
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000

In [57]:
df.sort_values("키", ascending=False)

      이름  나이     직업     국적    키          재산
4     헐크  33  핵물리학자     미국  270  1000000000
1     토르  45      신  아스가르드  190         NaN
3   원더우먼  27     공주  데미스키라  178         NaN
2  스파이더맨  18   고등학생     미국  177         600
0   아이언맨  58    CEO     미국  174 11500000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [58]:
df.sort_values("재산", ascending=False)

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000
2  스파이더맨  18   고등학생     미국  177         600
1     토르  45      신  아스가르드  190         NaN
3   원더우먼  27     공주  데미스키라  178         NaN

# 5. Modify Existing Column(s)

In [59]:
df2["국적"] = "대한민국"
df2

      이름  나이     직업    국적    키          재산
a   아이언맨  58    CEO  대한민국  174 11500000000
b     토르  45      신  대한민국  190         NaN
c  스파이더맨  18   고등학생  대한민국  177         600
d   원더우먼  27     공주  대한민국  178         NaN
e     헐크  33  핵물리학자  대한민국  270  1000000000
f   캡틴마블  25    파일럿  대한민국  170   340000000
g  블랙위도우  32    스파이  대한민국  170    50000000

Adding new column(s)

In [60]:
df2["전투력"] = [90, 100, 46, 79, 89, 78, 65]
df2

      이름  나이     직업    국적    키          재산  전투력
a   아이언맨  58    CEO  대한민국  174 11500000000   90
b     토르  45      신  대한민국  190         NaN  100
c  스파이더맨  18   고등학생  대한민국  177         600   46
d   원더우먼  27     공주  대한민국  178         NaN   79
e     헐크  33  핵물리학자  대한민국  270  1000000000   89
f   캡틴마블  25    파일럿  대한민국  170   340000000   78
g  블랙위도우  32    스파이  대한민국  170    50000000   65

In [61]:
df2["전투력"] = df2["전투력"] - 5
df2

      이름  나이     직업    국적    키          재산  전투력
a   아이언맨  58    CEO  대한민국  174 11500000000   85
b     토르  45      신  대한민국  190         NaN   95
c  스파이더맨  18   고등학생  대한민국  177         600   41
d   원더우먼  27     공주  대한민국  178         NaN   74
e     헐크  33  핵물리학자  대한민국  270  1000000000   84
f   캡틴마블  25    파일럿  대한민국  170   340000000   73
g  블랙위도우  32    스파이  대한민국  170    50000000   60

In [62]:
df2.columns = ["성명", "연령", "하는일", "출신국가", "신장", "재산현황", "파워"]
df2

      성명  연령    하는일  출신국가   신장        재산현황  파워
a   아이언맨  58    CEO  대한민국  174 11500000000  85
b     토르  45      신  대한민국  190         NaN  95
c  스파이더맨  18   고등학생  대한민국  177         600  41
d   원더우먼  27     공주  대한민국  178         NaN  74
e     헐크  33  핵물리학자  대한민국  270  1000000000  84
f   캡틴마블  25    파일럿  대한민국  170   340000000  73
g  블랙위도우  32    스파이  대한민국  170    50000000  60

# 6. Data Cleaning

In [63]:
df2.drop(index = ["a"])

      성명  연령    하는일  출신국가   신장       재산현황  파워
b     토르  45      신  대한민국  190        NaN  95
c  스파이더맨  18   고등학생  대한민국  177        600  41
d   원더우먼  27     공주  대한민국  178        NaN  74
e     헐크  33  핵물리학자  대한민국  270 1000000000  84
f   캡틴마블  25    파일럿  대한민국  170  340000000  73
g  블랙위도우  32    스파이  대한민국  170   50000000  60

To make the change permanent, additional arugment inplace=True

In [64]:
df2.drop(index = ["a"], inplace = True)
df2

      성명  연령    하는일  출신국가   신장       재산현황  파워
b     토르  45      신  대한민국  190        NaN  95
c  스파이더맨  18   고등학생  대한민국  177        600  41
d   원더우먼  27     공주  대한민국  178        NaN  74
e     헐크  33  핵물리학자  대한민국  270 1000000000  84
f   캡틴마블  25    파일럿  대한민국  170  340000000  73
g  블랙위도우  32    스파이  대한민국  170   50000000  60

In [65]:
df2.drop(columns=["신장"])

      성명  연령    하는일  출신국가       재산현황  파워
b     토르  45      신  대한민국        NaN  95
c  스파이더맨  18   고등학생  대한민국        600  41
d   원더우먼  27     공주  대한민국        NaN  74
e     헐크  33  핵물리학자  대한민국 1000000000  84
f   캡틴마블  25    파일럿  대한민국  340000000  73
g  블랙위도우  32    스파이  대한민국   50000000  60

In [67]:
df2.dropna()    # axis = 0 be default which deletes every row that contain NaN value

      성명  연령    하는일  출신국가   신장       재산현황  파워
c  스파이더맨  18   고등학생  대한민국  177        600  41
e     헐크  33  핵물리학자  대한민국  270 1000000000  84
f   캡틴마블  25    파일럿  대한민국  170  340000000  73
g  블랙위도우  32    스파이  대한민국  170   50000000  60

In [68]:
df2.dropna(axis=1)  # When axis is set to 1, column(s) that contain NaN value gets deleted.

      성명  연령    하는일  출신국가   신장  파워
b     토르  45      신  대한민국  190  95
c  스파이더맨  18   고등학생  대한민국  177  41
d   원더우먼  27     공주  대한민국  178  74
e     헐크  33  핵물리학자  대한민국  270  84
f   캡틴마블  25    파일럿  대한민국  170  73
g  블랙위도우  32    스파이  대한민국  170  60

In [70]:
df2.fillna(0)

      성명  연령    하는일  출신국가   신장       재산현황  파워
b     토르  45      신  대한민국  190          0  95
c  스파이더맨  18   고등학생  대한민국  177        600  41
d   원더우먼  27     공주  대한민국  178          0  74
e     헐크  33  핵물리학자  대한민국  270 1000000000  84
f   캡틴마블  25    파일럿  대한민국  170  340000000  73
g  블랙위도우  32    스파이  대한민국  170   50000000  60

In [72]:
df2.fillna(method = "bfill")

C:\Users\user\AppData\Local\Temp\ipykernel_10352\3421397829.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method = "bfill")

      성명  연령    하는일  출신국가   신장       재산현황  파워
b     토르  45      신  대한민국  190        600  95
c  스파이더맨  18   고등학생  대한민국  177        600  41
d   원더우먼  27     공주  대한민국  178 1000000000  74
e     헐크  33  핵물리학자  대한민국  270 1000000000  84
f   캡틴마블  25    파일럿  대한민국  170  340000000  73
g  블랙위도우  32    스파이  대한민국  170   50000000  60

In [74]:
df2["재산현황"].mean()

np.float64(347500150.0)

In [75]:
df2["재산현황"].fillna(df2["재산현황"].mean())

b    347500150
c          600
d    347500150
e   1000000000
f    340000000
g     50000000
Name: 재산현황, dtype: float64